[
  {
    "name": "Robô de Fazenda",
    "author": "Ricardo Anido, Brazil",
    "timeLimit": 1,
    "description": "Para desencorajar aves, como corvos e pardais, de se alimentarem de suas colheitas, um fazendeiro precisava colocar alguns espantalhos em seu campo de milho. Seu sobrinho gosta bastante de robôs e sugeriu que ele deveria usar um espantalho robô em vez disso: \"Um único espantalho robô pode proteger melhor todo o campo de milho e durará muito mais do que dez espantalhos tradicionais!\", ele disse.\nComo o fazendeiro considera seu sobrinho muito inteligente, ele seguiu seu conselho e comprou um espantalho robô. O robô se move ao longo de um caminho que circunda o campo de milho. No caminho, existem N estações de recarga não tripuladas, numeradas sequencialmente no sentido horário, começando do número 1. A figura abaixo mostra um exemplo com oito estações de recarga.\nO robô começa todos os dias na estação número 1, e é emitida uma sequencia de comandos que devem ser executados em ordem durante o dia. Estes comandos são gerados com base em algoritmos avançados de aprendizado de máquina que trabalham em dados coletados por sensores espalhados pelo campo de milho, garantindo uma cobertura ótima da cultura. Cada comando resulta em que o robô se mova para outra estação de carga ao lado da que está atualmente, no sentido horário ou anti-horário.\nApesar das promessas de cobertura ótima pelo robô, no final de um certo dia o fazendeiro encontrou parte de sua colheita devastada. Para descobrir o que poderia ter acontecido, o agricultor quer saber quantas vezes o robô estava na estação de carregamento mais próxima da área devastada. Dado o número da estação mais próxima da área devastada e a sequência de comandos para um único dia, você pode ajudar o fazendeiro a encontrar esse número?\nEntrada\nA primeira linha contém três números inteiros N, C e S que representam respectivamente o número de postos, o número de comandos e a estação de carga mais próxima da área devastada. A segunda linha contém C inteiros X1, X2, . . . , XC, representando a sequencia de comandos recebidos pelo robô espantalho. Para i = 1, 2, . . . , C, se Xi for 1, então o i-ésimo comando significa \"mover para a próxima estação de carregamento no sentido horário\", enquanto que se Xi for -1 então o i-ésimo comando significa \"mover para a próxima estação de carga no sentido anti-horário ordem\". O robô começa sempre na estação número 1.\nSaída\nA saída contém uma linha com um número inteiro que representa o número de vezes que o robô estava na estação número S durante o dia.",
    "samples": [
      ["8 8 3\n1 -1 1 1 1 -1 1 1", "2"],
      ["5 4 1\n1 1 1 1", "1"],
      ["2 1 1\n1", "1"],
      ["2 1 2 \n1", "1"],
      ["2 2 1\n-1 1", "2"],
      ["2 2 1\n-1 -1", "2"]
    ]
  },
  {
    "name": "Sequência Secreta",
    "author": "OBI",
    "timeLimit": 1,
    "description": "Na calçada em frente ao Palácio Imperial, não se sabe a razão, existe uma sequência de N números desenhados no chão. A sequência tem a seguinte forma: ela começa e termina com o número 1; apenas os números 1 e 2 aparecem nela; e o número 2 aparece pelo menos uma vez. Veja um exemplo na coluna (a) da figura ao lado.\nNinguém sabe o significado da sequência e, justamente por isso, várias teorias malucas surgiram. Uma delas diz que a sequência representa, na verdade, apenas um valor que estaria relacionado a um segredo dos imperadores. Esse valor é a quantidade máxima de números da sequência que poderiam ser marcados com um círculo, de modo que a sequência de números marcados não contenha dois números iguais consecutivos.\nA coluna (b) da figura ao lado ilustra uma sequência de 4 números marcados que obedece a restrição acima. Só que é possível marcar 7 números, como mostra a coluna (c) da figura.\nNeste problema, dada a sequência original de números desenhados no chão da calçada, seu programa deve computar e imprimir a quantidade máxima de números da sequência que poderiam ser marcados com um círculo sem que haja dois números iguais consecutivos na sequência marcada.\nEntrada\nA primeira linha da entrada contém um inteiro N representando o tamanho da sequência. As N linhas seguintes contêm, cada uma, um inteiro Vi , para 1 ≤ i ≤ N, definindo a sequência de números desenhados no chão da calçada imperial.\nSaída\nSeu programa deve imprimir uma linha contendo um número inteiro representando a quantidade máxima de números da sequência que poderiam ser marcados com um círculo sem que haja dois números iguais consecutivos na sequência marcada. Restrições\n• 3 ≤ N ≤ 500\n• Vi é igual a 1 ou 2, para 1 ≤ i ≤ N",
    "samples": [
      ["5\n1\n1\n1\n2\n1", "3"],
      ["12\n1\n2\n1\n2\n2\n2\n1\n1\n2\n2\n1\n1", "7"],
      ["3\n1\n2\n1", "3"]
    ]
  }
]
